christian-kohler.npm-intellisense
christian-kohler.path-intellisense
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
dendron.dendron
devmike.mikrotik-routeros-script
eamodio.gitlens
esbenp.prettier-vscode
github.copilot
github.copilot-chat
hediet.vscode-drawio
jebbs.plantuml
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
mushan.vscode-paste-image
redhat.vscode-yaml
ritwickdey.liveserver
saoudrizwan.claude-dev
shd101wyy.markdown-preview-enhanced
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
tomoki1207.pdf
vscode-icons-team.vscode-icons
zhuangtongfa.material-theme
